===========
Single line
===========

// Comment

---

(source_file
  (singleline_comment))

=========
Multiline
=========

/*
  comment
  */

---

(source_file
  (multiline_comment))

======
Nested
======

/*
  /* hello */
  world
  */

---

(source_file
  (multiline_comment))

========
Nested 2
========

/* foo

/ foo

     /*NoReg*/, baz
     
      
      */

---

(source_file
  (multiline_comment))